# IsTextPositionAdjustable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionSegment..::..IsTextPositionAdjustable Method
DimensionSegment Class See Also
---
Indicates if this dimension is supported to set/get TextPosition/LeaderPosition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public bool IsTextPositionAdjustable()
```

Visual Basic
---
```text
Public Function IsTextPositionAdjustable As Boolean
```

Visual C++
---
```text
public:
bool IsTextPositionAdjustable()
```

# ### Return Value
True if this dimension is supported to set/get TextPosition/LeaderPosition, false otherwise.
# See Also
DimensionSegment Class
Autodesk.Revit.DB Namespace